[
  {
    "title": "Gangubai Kathiawadi",
    "imageName": "https://m.media-amazon.com/images/M/MV5BN2M4NDM2NDItMzgzNy00OWRiLThhNjEtZDA2OWMyNTcwYzRjXkEyXkFqcGdeQXVyMTI1NDEyNTM5._V1_.jpg",
    "description": "Gangubai Kathiawadi is a gripping biographical crime film directed by Sanjay Leela Bhansali, based on a chapter from Hussain Zaidi's book 'Mafia Queens of Mumbai'. The film delves into the life of Gangubai Kothewali, a powerful and influential brothel owner in the red-light district of Kamathipura, Mumbai. Alia Bhatt delivers a stellar performance in the titular role, portraying Gangubai's journey from a young girl sold into prostitution to a formidable matriarch of the underworld.",
    "director": "Sanjay Leela Bhansali",
    "starCast": ["Alia Bhatt", "Ajay Devgn", "Shantanu Maheshwari"],
    "releaseDate": "2022-02-25",
    "imdbRating": "7.5"
  },
  {
    "title": "83",
    "imageName": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2021/11/2021_11$largeimg_1849643955.jpg",
    "description": "83 is an exhilarating sports drama film directed by Kabir Khan. It chronicles the inspiring journey of the Indian cricket team that defied all odds to win the 1983 Cricket World Cup, under the leadership of the legendary Kapil Dev. Ranveer Singh delivers a captivating performance as Kapil Dev, leading a talented ensemble cast including Deepika Padukone and Tahir Raj Bhasin. The film captures the euphoria of India's historic victory and celebrates the indomitable spirit of the team.",
    "director": "Kabir Khan",
    "starCast": ["Ranveer Singh", "Deepika Padukone", "Tahir Raj Bhasin"],
    "releaseDate": "2022-01-21",
    "imdbRating": "7.6"
  },
  {
    "title": "Radhe Shyam",
    "imageName": "https://m.media-amazon.com/images/M/MV5BZDQ5YjAxMmYtOGM3Zi00MWU2LWJmOTMtZjhhYjkyNGQ1NjE3XkEyXkFqcGdeQXVyMTA3MDk2NDg2._V1_.jpg",
    "description": "Radhe Shyam is a mesmerizing romantic drama film directed by Radha Krishna Kumar. Set in the backdrop of Europe in the 1970s, the film follows the love story between Vikramaditya, a palmist played by Prabhas, and Prerana, a princess played by Pooja Hegde. Their love transcends time and societal norms, but faces numerous obstacles along the way. With stunning visuals and a soulful soundtrack, Radhe Shyam is a tale of love, destiny, and the power of true connection.",
    "director": "Radha Krishna Kumar",
    "starCast": ["Prabhas", "Pooja Hegde", "Sachin Khedekar"],
    "releaseDate": "2022-03-11",
    "imdbRating": "5.2"
  },
  {
    "title": "Laal Singh Chaddha",
    "imageName": "https://upload.wikimedia.org/wikipedia/en/thumb/7/70/Laal_Singh_Chaddha.jpg/220px-Laal_Singh_Chaddha.jpg",
    "description": "Laal Singh Chaddha is a heartwarming comedy-drama film directed by Advait Chandan. Inspired by the 1994 American classic 'Forrest Gump', the film follows the extraordinary journey of Laal Singh Chaddha, portrayed by Aamir Khan, a simple-minded yet kind-hearted man with a unique perspective on life. As he navigates through significant historical events, Laal Singh Chaddha touches the lives of everyone he encounters, spreading hope, joy, and love.",
    "director": "Advait Chandan",
    "starCast": ["Aamir Khan", "Kareena Kapoor Khan", "Naga Chaitanya"],
    "releaseDate": "2021-12-24",
    "imdbRating": "5.6"
  },
  {
    "title": "Shabaash Mithu",
    "imageName": "https://filmfare.wwmindia.com/content/2022/apr/taapseepannu11651214370.jpg",
    "description": "Shabaash Mithu is an inspiring biographical sports film based on the life of Indian cricketer Mithali Raj, directed by Rahul Dholakia. Taapsee Pannu delivers a compelling performance as Mithali Raj, depicting her journey from a young girl with a passion for cricket to becoming the captain of the Indian women's cricket team. The film celebrates Mithali's resilience, determination, and achievements in breaking barriers and inspiring a generation of young athletes.",
    "director": "Rahul Dholakia",
    "starCast": ["Taapsee Pannu", "Rahul Bose", "Vipin Sharma"],
    "releaseDate": "2022-02-04",
    "imdbRating": "7.5"
  },
  {
    "title": "Prithviraj",
    "imageName": "https://m.media-amazon.com/images/M/MV5BOGI1N2QwNjYtMjQzOS00NjZiLTg1YzEtMDVjZGY0YjkwODNjXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
    "description": "Prithviraj is a grand historical action drama film directed by Chandraprakash Dwivedi. Akshay Kumar delivers a powerful performance as Prithviraj Chauhan, the legendary warrior king of the Chahamana dynasty. The film chronicles Prithviraj's valiant efforts to protect his kingdom from external threats and uphold the ideals of courage, honor, and sacrifice. With breathtaking visuals and epic battle sequences, Prithviraj is a tribute to the enduring legacy of a true Indian hero.",
    "director": "Chandraprakash Dwivedi",
    "starCast": ["Akshay Kumar", "Manushi Chhillar", "Sanjay Dutt"],
    "releaseDate": "2022-01-21",
    "imdbRating": "6.5"
  },
  {
    "title": "Bachchan Pandey",
    "imageName": "https://m.media-amazon.com/images/M/MV5BOWE5ZjljZDEtYTZmNy00MGVlLWJjNjEtMWUwMzUyMDc5NTA3XkEyXkFqcGdeQXVyODgzMDMwODI@._V1_.jpg&s",
    "description": "Bachchan Pandey is a rollicking action-comedy film directed by Farhad Samji. Akshay Kumar shines in the titular role of Bachchan Pandey, a quirky and fearless gangster with a heart of gold. The film follows Bachchan's hilarious misadventures as he navigates through the criminal underworld with his unique brand of humor and charm. With Kriti Sanon and Arshad Warsi adding to the comedic chaos, Bachchan Pandey promises non-stop entertainment and laughter.",
    "director": "Farhad Samji",
    "starCast": ["Akshay Kumar", "Kriti Sanon", "Arshad Warsi"],
    "releaseDate": "2022-03-18",
    "imdbRating": "6.8"
  },
  {
    "title": "Atrangi Re",
    "imageName": "https://m.media-amazon.com/images/M/MV5BZGI2MDk2NGEtNDcwZC00NmU5LTk5NmMtODE1NDRlMDFmODU2XkEyXkFqcGdeQXVyNDAzNDk0MTQ@._V1_.jpg",
    "description": "Atrangi Re is a captivating romantic drama film directed by Aanand L. Rai. Dhanush, Sara Ali Khan, and Akshay Kumar deliver mesmerizing performances in this unconventional love story that transcends boundaries of time, culture, and society. The film follows the intertwining lives of three individuals whose paths cross unexpectedly, leading to a journey of self-discovery, acceptance, and unconditional love. With its soulful narrative and heartfelt performances, Atrangi Re is a celebration of love in all its forms.",
    "director": "Aanand L. Rai",
    "starCast": ["Dhanush", "Sara Ali Khan", "Akshay Kumar"],
    "releaseDate": "2021-08-06",
    "imdbRating": "7.8"
  },
  {
    "title": "Jhund",
    "imageName": "https://upload.wikimedia.org/wikipedia/en/5/5b/Jhund_Film_Poster.jpg",
    "description": "Jhund is a poignant sports drama film directed by Nagraj Manjule. Amitabh Bachchan delivers a powerhouse performance as Vijay Barse, a retired sports teacher who starts a soccer team for underprivileged children in a slum. The film explores themes of redemption, hope, and the transformative power of sports in shaping young lives. With Akash Thosar and Rinku Rajguru delivering stellar performances, Jhund is an inspiring tale of resilience and triumph against all odds.",
    "director": "Nagraj Manjule",
    "starCast": ["Amitabh Bachchan", "Akash Thosar", "Rinku Rajguru"],
    "releaseDate": "2022-03-04",
    "imdbRating": "8.1"
  },
  {
    "title": "Bhool Bhulaiyaa 2",
    "imageName": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ4BmT6kZWkieCJ8jZG16HnsTLNFEaMhxVsLbMen2hAxSjUBXp7",
    "description": "Bhool Bhulaiyaa 2 is a spine-chilling horror comedy film directed by Anees Bazmee. Kartik Aaryan, Kiara Advani, and Tabu lead the cast in this thrilling sequel to the 2007 cult classic 'Bhool Bhulaiyaa'. The film follows the eerie occurrences in an ancestral palace, where a series of supernatural events unfold, leaving the characters questioning reality and sanity. With its mix of humor, suspense, and supernatural elements, Bhool Bhulaiyaa 2 promises a roller-coaster ride of thrills and laughter.",
    "director": "Anees Bazmee",
    "starCast": ["Kartik Aaryan", "Kiara Advani", "Tabu"],
    "releaseDate": "2022-03-25",
    "imdbRating": "7.2"
  }
]
